In [4]:
#Task 1
#There are three different tables as given above. Please make three dataframe in python 
#and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only

In [220]:
## Importing required libraries
import pandas as pd
import numpy as np

## Creating Project DataFrame
project_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005', 'A002', 'A005', 'A003', 'A001', 'A003', 'A001', 'A004', 'A004', 'A005'],
    'Project': ["Project 1", "Project 2", "Project 3", "Project 4", "Project 5", "Project 6", "Project 7", "Project 8", "Project 9", "Project 10", "Project 11", "Project 12", "Project 13", "Project 14"],
    'Cost': [1002000, 2000000, 4500000, 5500000, np.nan, 680000, 400000, 350000, np.nan, 300000, 2000000, 1000000, 3000000, 200000],
    'Status': ['Finished', 'Ongoing', 'Finished', 'Ongoing', 'Finished', 'Failed', 'Finished', 'Failed', 'Ongoing', 'Finished', 'Failed', 'Ongoing', 'Finished', 'Finished']
}
project_df = pd.DataFrame(project_data)


## Creating Employee DataFrame
employee_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Name': ['John Alter', 'Alice Luxumberg', 'Tom Sabestine', 'Nina Adgra', 'Amy Johny'],
    'Gender': ['M', 'F', 'M', 'F', 'F'],
    'City': ['Paris', 'London', 'Berlin', 'Newyork', 'Madrid'],
    'Age': [25, 27, 29, 31, 30]
}
employee_df = pd.DataFrame(employee_data)


## Creating Seniority Level DataFrame
seniority_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Designation Level': [2, 2, 3, 2, 3]
}
seniority_df = pd.DataFrame(seniority_data)


## Saving DataFrames to CSV
project_df.to_csv('project.csv', index=False)
employee_df.to_csv('employee.csv', index=False)
seniority_df.to_csv('seniority.csv', index=False)

print("Three DataFrame CSV Created Successfully!")

Three DataFrame CSV Created Successfully!

In [222]:
## Displaying the DataFrames for rechecking.
print(project_df)
print(employee_df)
print(seniority_df)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished
     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30
     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [ ]:
#Task 2
#The cost column in the dataframe “Project” has some missing values. Your task is to
#compute these missing values. Replace the missing values by running average. You
#should use the “For” loop for this task.

In [224]:
# Loop to calculate running average and fill missing values
running_sum = 0
count = 0

for index, row in project_df.iterrows():
    if pd.isna(row['Cost']):
        # Replaceing missing value with the running average
        if count > 0:
            project_df.at[index, 'Cost'] = running_sum / count
    else:
        # Updateing running sum and count when the value is not missing
        running_sum += row['Cost']
        count += 1

# Changing the 'Cost' column to float and ensure no scientific notation
project_df['Cost'] = project_df['Cost'].apply(lambda x: round(x, 2) if pd.notna(x) else x)

# Displaying the updated DataFrame
print(project_df)

      ID     Project        Cost    Status
0   A001   Project 1  1002000.00  Finished
1   A002   Project 2  2000000.00   Ongoing
2   A003   Project 3  4500000.00  Finished
3   A004   Project 4  5500000.00   Ongoing
4   A005   Project 5  3250500.00  Finished
5   A002   Project 6   680000.00    Failed
6   A005   Project 7   400000.00  Finished
7   A003   Project 8   350000.00    Failed
8   A001   Project 9  2061714.29   Ongoing
9   A003  Project 10   300000.00  Finished
10  A001  Project 11  2000000.00    Failed
11  A004  Project 12  1000000.00   Ongoing
12  A004  Project 13  3000000.00  Finished
13  A005  Project 14   200000.00  Finished

In [42]:
#Task 3
#Split the name column in the Employee dataframe into two new columns “First Name”,
#and “LastName” and remove the older “name” column.

In [226]:
# Reading the employee CSV file
employee_df = pd.read_csv('employee.csv')

# Spliting the Name column into First Name and Last Name
employee_df[['First Name', 'Last Name']] = employee_df['Name'].str.split(' ', expand=True)

# Removing the original Name column
employee_df = employee_df.drop('Name', axis=1)

# Displaying the updated DataFrame
print(employee_df)

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [ ]:
#Task 4
#Join all three dataframes in one single dataframe. Name it “Final”

In [228]:
## Merging all three DataFrames based on ID
final_df = employee_df.merge(seniority_df, on='ID').merge(project_df, on='ID')

# Displaying the final DataFrame
print(final_df)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  2
3   A002      F   London   27      Alice  Luxumberg                  2
4   A002      F   London   27      Alice  Luxumberg                  2
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  3
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project        Cost    Status
0    Project 1  1002000.00  Finished
1    Project 9  2061714.29   Ongoing
2   Project 11  2000000.00    Failed
3    Project 2  2000000.00   Ongoing
4    Project 6   680000.00    Failed
5    Project 3  4500000.00  Finished
6    Project 8   350000.00    Failed
7   Project 10   300000.00  Finished
8    Project 4  5500000.00   Ongoing
9   Project 12  1000000.00   Ongoing
10  Project 13  3000000.00  Finished
11   Project 5  3250500.00  Finished
12   Project 7   400000.00  Finished
13  Project 14   200000.00  Finished

In [ ]:
#Task 5
#Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project 
#cost only to employees who have finished the projects.

In [230]:
# Adding a new column 'Bonus' for employees who have finished the project
final_df['Bonus'] = final_df.apply(lambda row: 0.05 * row['Cost'] if row['Status'] == 'Finished' else 0, axis=1)

# Displaying the updated DataFrame
print(final_df)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  2
3   A002      F   London   27      Alice  Luxumberg                  2
4   A002      F   London   27      Alice  Luxumberg                  2
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  3
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project        Cost    Status     Bonus
0    Project 1  1002000.00  Finished   50100.0
1    Project 9  2061714.29   Ongoing       0.0
2   Project 11  2000000.00    Failed       0.0
3    Project 2  2000000.00   Ongoing       0.0
4    Project 6   680000.00    Failed       0.0
5    Project 3  4500000.00  Finished  225000.0
6    Project 8   350000.00    Failed       0.0
7   Project 10   300000.00  Finished   15000.0
8    Project 4  5500000.00   Ongoing       0.0
9   Project 12  1000000.00   Ongoing       0.0
10  Project 13  3000000.00  Finished  150000.0
11   Project 5  3250500.00  Finished  162525.0
12   Project 7   400000.00  Finished   20000.0
13  Project 14   200000.00  Finished   10000.0

In [ ]:
#Task 6
#Demote the designation level by 1, whose projects have status “fail”. Delete the
#employees record whose designation level is above 4.

In [232]:
# Demoting the Designation Level by 1 for employees whose project status is "Failed"
final_df.loc[final_df['Status'] == 'Failed', 'Designation Level'] -= 1

# Deleting employees whose Designation Level is above 4
final_df = final_df[final_df['Designation Level'] <= 4]

# Displaying the updated DataFrame
print(final_df)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  1
3   A002      F   London   27      Alice  Luxumberg                  2
4   A002      F   London   27      Alice  Luxumberg                  1
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  2
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project        Cost    Status     Bonus
0    Project 1  1002000.00  Finished   50100.0
1    Project 9  2061714.29   Ongoing       0.0
2   Project 11  2000000.00    Failed       0.0
3    Project 2  2000000.00   Ongoing       0.0
4    Project 6   680000.00    Failed       0.0
5    Project 3  4500000.00  Finished  225000.0
6    Project 8   350000.00    Failed       0.0
7   Project 10   300000.00  Finished   15000.0
8    Project 4  5500000.00   Ongoing       0.0
9   Project 12  1000000.00   Ongoing       0.0
10  Project 13  3000000.00  Finished  150000.0
11   Project 5  3250500.00  Finished  162525.0
12   Project 7   400000.00  Finished   20000.0
13  Project 14   200000.00  Finished   10000.0

In [ ]:
#Task 7
#Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [234]:
# Adding appropriate title based on gender
final_df['First Name'] = np.where(final_df['Gender'] == 'M', 
                                 'Mr. ' + final_df['First Name'],
                                 'Mrs. ' + final_df['First Name'])

# Removing gender column
final_df = final_df.drop('Gender', axis=1)

# Displaying the updated final DataFrame
print(final_df)

      ID     City  Age  First Name  Last Name  Designation Level     Project  \
0   A001    Paris   25    Mr. John      Alter                  2   Project 1
1   A001    Paris   25    Mr. John      Alter                  2   Project 9
2   A001    Paris   25    Mr. John      Alter                  1  Project 11
3   A002   London   27  Mrs. Alice  Luxumberg                  2   Project 2
4   A002   London   27  Mrs. Alice  Luxumberg                  1   Project 6
5   A003   Berlin   29     Mr. Tom  Sabestine                  3   Project 3
6   A003   Berlin   29     Mr. Tom  Sabestine                  2   Project 8
7   A003   Berlin   29     Mr. Tom  Sabestine                  3  Project 10
8   A004  Newyork   31   Mrs. Nina      Adgra                  2   Project 4
9   A004  Newyork   31   Mrs. Nina      Adgra                  2  Project 12
10  A004  Newyork   31   Mrs. Nina      Adgra                  2  Project 13
11  A005   Madrid   30    Mrs. Amy      Johny                  3   Project 5
12  A005   Madrid   30    Mrs. Amy      Johny                  3   Project 7
13  A005   Madrid   30    Mrs. Amy      Johny                  3  Project 14

          Cost    Status     Bonus
0   1002000.00  Finished   50100.0
1   2061714.29   Ongoing       0.0
2   2000000.00    Failed       0.0
3   2000000.00   Ongoing       0.0
4    680000.00    Failed       0.0
5   4500000.00  Finished  225000.0
6    350000.00    Failed       0.0
7    300000.00  Finished   15000.0
8   5500000.00   Ongoing       0.0
9   1000000.00   Ongoing       0.0
10  3000000.00  Finished  150000.0
11  3250500.00  Finished  162525.0
12   400000.00  Finished   20000.0
13   200000.00  Finished   10000.0

In [ ]:
#Task 8
#Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

In [236]:
# Using a for loop to promote Designation Level for employees whose age is more than 29
for index, row in final_df.iterrows():
    # Checking if age is more than 29
    if row['Age'] > 29:
        # Promoting Designation Level by 1
        final_df.at[index, 'Designation Level'] += 1

# Displaying the updated DataFrame
print(final_df)

      ID     City  Age  First Name  Last Name  Designation Level     Project  \
0   A001    Paris   25    Mr. John      Alter                  2   Project 1
1   A001    Paris   25    Mr. John      Alter                  2   Project 9
2   A001    Paris   25    Mr. John      Alter                  1  Project 11
3   A002   London   27  Mrs. Alice  Luxumberg                  2   Project 2
4   A002   London   27  Mrs. Alice  Luxumberg                  1   Project 6
5   A003   Berlin   29     Mr. Tom  Sabestine                  3   Project 3
6   A003   Berlin   29     Mr. Tom  Sabestine                  2   Project 8
7   A003   Berlin   29     Mr. Tom  Sabestine                  3  Project 10
8   A004  Newyork   31   Mrs. Nina      Adgra                  3   Project 4
9   A004  Newyork   31   Mrs. Nina      Adgra                  3  Project 12
10  A004  Newyork   31   Mrs. Nina      Adgra                  3  Project 13
11  A005   Madrid   30    Mrs. Amy      Johny                  4   Project 5
12  A005   Madrid   30    Mrs. Amy      Johny                  4   Project 7
13  A005   Madrid   30    Mrs. Amy      Johny                  4  Project 14

          Cost    Status     Bonus
0   1002000.00  Finished   50100.0
1   2061714.29   Ongoing       0.0
2   2000000.00    Failed       0.0
3   2000000.00   Ongoing       0.0
4    680000.00    Failed       0.0
5   4500000.00  Finished  225000.0
6    350000.00    Failed       0.0
7    300000.00  Finished   15000.0
8   5500000.00   Ongoing       0.0
9   1000000.00   Ongoing       0.0
10  3000000.00  Finished  150000.0
11  3250500.00  Finished  162525.0
12   400000.00  Finished   20000.0
13   200000.00  Finished   10000.0

In [ ]:
#Task 9
#Add the cost of all projects for each Employee and save it in new dataframe “TotalProjCost” with three columns ID, First Name, and Total cost

In [238]:
# Grouping by ID and First Name, and summing the 'Cost' for each employee
TotalProjCost = final_df.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()

# Renaming 'Cost' column to 'Total cost'
TotalProjCost.rename(columns={'Cost': 'Total cost'}, inplace=True)

# Displaying the new DataFrame
print(TotalProjCost)

     ID  First Name  Total cost
0  A001    Mr. John  5063714.29
1  A002  Mrs. Alice  2680000.00
2  A003     Mr. Tom  5150000.00
3  A004   Mrs. Nina  9500000.00
4  A005    Mrs. Amy  3850500.00

In [ ]:
#Task 10
#Print all the employee details whose city name contains the letter “o” in it

In [240]:
# Filtering employees whose city contains the letter "o"
filtered_employees = employee_df[employee_df['City'].str.contains('o', case=False, na=False)]

# Displaying the filtered DataFrame
print(filtered_employees)

     ID Gender     City  Age First Name  Last Name
1  A002      F   London   27      Alice  Luxumberg
3  A004      F  Newyork   31       Nina      Adgra